src/AccumulationRegisters/HumanResourcesAccounting.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<AccumulationRegister>
		<Properties>
			<Name>HumanResourcesAccounting</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>AmountCur</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ContentOfAccountingRecord</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Employee</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>AccountingPeriod</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/HumanResourcesAccounting/Ext/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// COMMON PROCEDURES AND FUNCTIONS

// Procedure creates empty temporary table of records modification.
//
Procedure CreateEmptyTemporaryTableChange(AdditionalProperties) Export
	
	If NOT AdditionalProperties.Property("ForPosting")
	 OR NOT AdditionalProperties.ForPosting.Property("StructureTemporaryTables") Then
		Return;
	EndIf;
	
	StructureTemporaryTables = AdditionalProperties.ForPosting.StructureTemporaryTables;
	
	Query = New Query(
	"SELECT TOP 0
	|	HumanResourcesAccounting.LineNumber AS LineNumber,
	|	HumanResourcesAccounting.Company AS Company,
	|	HumanResourcesAccounting.Employee AS Employee,
	|	HumanResourcesAccounting.Currency AS Currency,
	|	HumanResourcesAccounting.AccountingPeriod AS AccountingPeriod,
	|	HumanResourcesAccounting.Amount AS AmountBeforeWrite,
	|	HumanResourcesAccounting.Amount AS AmountChange,
	|	HumanResourcesAccounting.Amount AS AmountOnWrite,
	|	HumanResourcesAccounting.AmountCur AS AmountCurBeforeWrite,
	|	HumanResourcesAccounting.AmountCur AS AmountCurChange,
	|	HumanResourcesAccounting.AmountCur AS AmountCurOnWrite
	|INTO RegisterRecordsHumanResourcesAccountingChange
	|FROM
	|	AccumulationRegister.HumanResourcesAccounting AS HumanResourcesAccounting");
	
	Query.TempTablesManager = StructureTemporaryTables.TempTablesManager;
	QueryResult = Query.Execute();
	
	StructureTemporaryTables.Insert("RegisterRecordsHumanResourcesAccountingChange", False);
	
EndProcedure // CreateEmptyTemporaryTableChange()
